[
    {
        "judul": "Ganglion",
        "sinopsis": "Early 2000s Tokyo. Isobe, a combatant for the evil corporation Ganglion, spends his days on the battlefield. Whether it's the \"Tokyo Cedar Pollen Operation\" or the \"Mount Fuji Demolition Plan,\" he faces off in nothing but a bodysuit, only to be crushed by the hero Hopeman time and again. As he struggles under unreasonable bosses during the dawn of compliance, his story unfolds—a workplace drama dedicated to all who work, following the bittersweet life of a salaryman soldier.",
        "genre": [
            "Action",
            "Adult Cast"
        ],
        "metadata": [
            "TV",
            "PG-13",
            "Airing",
            "2025",
            "3 min",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/ganglion-2a9a-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e97fb7169c31976b77579a&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Psychic Princess Season 2",
        "sinopsis": "Qian Yunxi, the eldest daughter of the prime minister of Guyu Kingdom, has supernatural powers. She has been considered an unlucky person since she was a child and is forced to marry into the Ye Palace. Seeing her sincerity and kindness, the prince Ye Youming uses thousands of tricks to show his kindness. Qian Yunxi thinks that the prince has bad intentions, so she fights with him. A chaotic cohabitation life begins.",
        "genre": [
            "Comedy",
            "Drama",
            "Historical",
            "Romance"
        ],
        "metadata": [
            "ONA",
            "Airing",
            "2025",
            "15 min"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/psychic-princess-season-2-2fa7-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=NjU1MjQyZDkzYTliMDc4MDNiOGE5MTQwMmVkZTA2MWU6ZDJiOTI0ZmE5ZjY4OGExNDE3NGQ2OTU0OWQ2MWE2OWE&type=hls"
    },
    {
        "judul": "Beyblade X",
        "sinopsis": "Kazami Bird, aiming to become a professional, meets former champion Kurosu Ex also known as 'Kamen X' and forms a team so that they can aim for the \"top\" of the X Tower. But what awaits them is a spectacular battle that no one has ever seen before. The yet unseen 'X'. The super accelerated (Xtreme) beyblade runs through a new era!",
        "genre": [
            "Adventure",
            "Kids",
            "Sports"
        ],
        "metadata": [
            "TV",
            "PG",
            "Airing",
            "2023",
            "25 min",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/beyblade-x-07e3-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=6521791d44c6d04c122cfacc&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Style of Hiroshi Nohara Lunch",
        "sinopsis": "This series follows Hiroshi Nohara's ultimate lunchtime philosophy, as he carefully selects and enjoys his midday meals within the constraints of a limited budget and break time. But it's not just about savoring food—Hiroshi delves into cooking trivia, preparation methods, and the everyday dilemmas of a salaryman. From debating whether to treat his juniors to lunch, to finding quick meals between sales meetings, and even venting about his boss, the series is packed with relatable moments for working professionals.",
        "genre": [
            "Comedy",
            "Gourmet"
        ],
        "metadata": [
            "TV",
            "PG-13",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/nohara-hiroshi-hiru-meshi-no-ryuugi-ac7e-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e062fe169c31976b6ab7d9&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Sanda",
        "sinopsis": "The story starts with Sanda, a second year middle school student, getting attacked with a kitchen knife by his classmate Fuyumura. While Sanda couldn't make sense of the situation at first, he gradually came to believe that Fuyumura's actions were just mean acts stemming off from the latter having a peculiar puberty phase. But that was all actually a misunderstanding. Fuyumura is seriously questioning if Sanda is actually the descendant of a certain family...",
        "genre": [
            "Action",
            "Mystery",
            "School",
            "Shounen"
        ],
        "metadata": [
            "TV",
            "PG-13",
            "Airing",
            "2025",
            "24 min",
            "SUB",
            "DUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/sanda-cef3-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e05b62169c31976b69cbea&source=vidstream&ln=en-US"
    },
    {
        "judul": "Shabake (TV)",
        "sinopsis": "It is the Edo period. Ichitarou, the young master of Nagasakiya, one of the largest stores in Nihonbashi, has been in poor health since birth and is unable to go out. However, Ichitarou is always protected by demons such as Shirasawa and Inugami, who serve him. One night, Ichitarou goes out secretly and witnesses a murder. From that day on, bizarre murders begin to occur one after another in Edo... With the help of the demons, Ichitarou's search for the culprit begins!",
        "genre": [
            "Historical",
            "Mystery",
            "Mythology",
            "Supernatural"
        ],
        "metadata": [
            "TV",
            "PG-13",
            "Airing",
            "2025",
            "23 min",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/shabake-2-a696-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e05ada169c31976b69bdd5&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "May I Ask for One Final Thing?",
        "sinopsis": "In the middle of a ball, Scarlet's fiancé, Kyle, suddenly calls off their engagement. She's falsely accused of being a bully and people unfairly call her a \"Villainess.\" The aristocrats and noble families all denounce her. For years, she had to put up with his abuse and idiocy, but she can't take anymore of it! At her wit's end, she asks for one last favor; to give him a good fist in the face. So begins Scarlet's story of revenge against Kyle and his cronies! A fantasy about an elegant yet rebellious fighter, who doesn't let anyone take advantage of her!!",
        "genre": [
            "Action",
            "Comedy",
            "Romance"
        ],
        "metadata": [
            "TV",
            "PG-13",
            "Airing",
            "2025",
            "24 min",
            "SUB",
            "DUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/may-i-ask-for-one-final-thing-c2af-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e057cb169c31976b696ab5&source=vidstream&ln=en-US"
    },
    {
        "judul": "Watari-kun's ****** Is about to Collapse",
        "sinopsis": "Two years ago, the death of Naoto Watari's parents left him as the sole caretaker for his younger sister Suzushiro \"Suzu\" Watari and forced him to move in with their aunt. So devoted is he to Suzu that he refuses to join clubs or even hang out with anyone, earning him snide comments and the title of \"siscon\" at his new school. But as long as Suzu is safe and happy, Naoto does not care what everyone else says. However, his sneering classmates may turn out to be the least of his worries. The sudden transfer of a girl named Satsuki Tachibana brings back traumatic memories from his past—a past she had a hand in making so unpleasant. Nasty secrets, unknown to Naoto, begin to surface with her arrival, threatening his new life.",
        "genre": [
            "Comedy",
            "Drama",
            "Romantic Subtext",
            "School",
            "Seinen"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/watari-kun-no-xx-ga-houkai-sunzen-f9a2-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=6868001c169c31976bcbe9b3&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Tougen Anki",
        "sinopsis": "Individuals with Momotarou and Oni blood coursing through their veins maintain a longstanding rivalry. The Oni are careless, rash, and disorderly, while the Momotarou protect the human world from the uncontrollable Oni. Shiki Ichinose is a reckless and irresponsible teenager, aware of his defiance and even proud of his expulsion from school. Despite Shiki's rebellious attitude, his foster father, Tsuyoshi, cares about him deeply. Tsuyoshi's selfless love is soon shown in an explosive incident when a Momotarou barges in looking for Shiki. As a Momotarou himself, Tsuyoshi has been hiding Shiki for years and keeping his Oni origins a secret even from him. As he gives up his life to save Shiki and confesses everything in his dying breath, Shiki's Oni blood awakens for the first time, transforming him into an unruly monster overflowing with rage and a thirst for revenge. Shiki's momentary outburst attracts the attention of Naito Mudano, an Oni teacher at the Rakshasa Academy—an institution for young Oni in need of understanding and perfecting their powers. Before Shiki can avenge his father, he must learn to control his headstrong and impulsive nature and, above all, fight against his own demonic blood.",
        "genre": [
            "Action",
            "Fantasy",
            "Mythology",
            "Shounen"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "SUB",
            "DUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/tougen-anki-6802-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68740f78169c31976b86f1de&source=vidstream&ln=en-US"
    },
    {
        "judul": "Cat's♥Eye",
        "sinopsis": "The protagonists of the series are the three Kisugi sisters—Hitomi, Rui and Ai—who run a café called Cat's Eye. The sisters lead a double life as a trio of highly skilled art thieves, leaving cards with the name \"Cat's Eye\" at the scene of their crimes. They steal works of art that belonged to their long-missing father, Heinz who was a famous art collector during the Nazi regime, in the hopes of him contacting them. Toshio, the police officer investigating this case is the fiancé of Hitomi. He also swears to capture and bring down the Cat's Eye Gang.",
        "genre": [
            "Action",
            "Adventure",
            "Comedy",
            "Mystery",
            "Romance",
            "Shounen"
        ],
        "metadata": [
            "ONA",
            "PG-13",
            "Airing",
            "2025",
            "24 min",
            "SUB",
            "DUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/catseye-8d56-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e19a76169c31976b947539&source=vidstream&ln=en-US"
    },
    {
        "judul": "My Gift Lvl 9999 Unlimited Gacha: Backstabbed in a Backwater Dungeon, I'm Out for Revenge!",
        "sinopsis": "When Light is kicked out of the Concord of the Tribes, his former comrades instantly turn on him. Light escapes this diabolical act of betrayal by the skin of his teeth...only to find himself in the deepest part of the Abyss, the most dangerous dungeon in the realm! To avoid being eaten by carnivorous monsters, he uses the Unlimited Gacha, his sole magical skill. But where it previously only produced junk items, this time Mei—a gorgeous Level 9999 fighter in a maid outfit—springs forth! Fast forward three years and Light has carved out his own kingdom in this backwater dungeon, summoning more beautiful Level 9999 warriors who swear absolute fealty to him. Now a powerful Level 9999 Overlord himself, Light plans to ascend to the surface and take revenge on his betrayers one by one!",
        "genre": [
            "Action",
            "Fantasy"
        ],
        "metadata": [
            "TV",
            "PG-13",
            "Airing",
            "2025",
            "24 min",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/shinjiteita-nakama-tachi-ni-dungeon-okuchi-de-korosarekaketa-ga-gift-mugen-gacha-de-level-9999-no-nakama-tachi-wo-te-ni-irete-moto-party-member-to-sekai-ni-fukushuu-zamaa-shimasu-b1c4-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e0578b169c31976b696208&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "So You're Raising a Warrior",
        "sinopsis": "The contrastingly cute dragon, Al, the first king-killer in the demon world, who has a full combat score but is ready to die and longs for a happy retirement, bumps into the cunning human magician Le Fei, and accidentally becomes a super dad who raises Le Fei's son Dino. Will Dino be an ordinary and happy child, or will he bravely pick up the Warrior's Holy Sword and face his own destiny...",
        "genre": [
            "Childcare",
            "Comedy",
            "Fantasy"
        ],
        "metadata": [
            "ONA",
            "Airing",
            "2025"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/so-youre-raising-a-warrior-b3ab-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=ZjA1ZTE4MTc3NmQ5MDNjNzQ3MzIyMDE0NzkyNjQxODI6MGU3Yjg0N2E1NDVjNzM3ZDA1NWFiNGU2YmViMzBiZjU&type=hls"
    },
    {
        "judul": "Word of Honor Season 2",
        "sinopsis": "Second season of Jun You Yun.",
        "genre": [
            "Action",
            "Adventure",
            "Fantasy",
            "Historical",
            "Martial Arts"
        ],
        "metadata": [
            "ONA",
            "PG-13",
            "Airing",
            "2025",
            "15 min"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/jun-you-yun-2nd-season-8993-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=NDZiZTQ3ZGQxMmVlYjZiYjdmNzYyNmMwNjYzZWM3ZDM6NTZjYzdjYTBhODhjMTJiNzY0NDNkZmE2YTZkZjZmNTM&type=hls"
    },
    {
        "judul": "I Saved Myself with a Potion Life in another world",
        "sinopsis": "Kaede, an ordinary high school girl, suddenly wakes up in an unfamiliar alleyway—only to realize she's been transported to a mysterious world inhabited by beastmen, elves, and dragons. Among her belongings, she discovers a strange book that wasn't there before. To her surprise, it allows her to create potions simply by chanting the word \"create.\" Relying on these potions to survive, Kaede navigates the challenges of this fantastical world while clinging to the hope of one day returning to Japan. Her journey of struggle and discovery in this otherworldly realm is just beginning...",
        "genre": [
            "Fantasy",
            "Isekai"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "13 min",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/potion-wagami-wo-tasukeru-9aef-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68def4b5169c31976b4a3929&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Dusk Beyond the End of the World",
        "sinopsis": "After waking from a long cryogenic sleep, high school student Akira Himegami finds himself in a world he no longer recognizes. The city lies in ruins from war, society is now governed by an organization called OWEL, and traditional marriage has been replaced by a new system known as \"Elsie.\" As Akira struggles to comprehend this drastically changed future, a familiar figure appears before him—Yuugure, who bears a strong resemblance to his girlfriend Towasa. To his shock, Yuugure smiles gently and proposes: \"Akira... please marry me.\" Confused by her sudden proposal, Akira agrees to travel with Yuugure, holding onto hope that somewhere in this world, the real Towasa is still alive. Along their journey, they encounter the evolving forms of love in this new era and reflect on what their bond truly means.",
        "genre": [
            "Romance",
            "Sci-Fi"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/towa-no-yuugure-271c-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68d57188169c31976b656d52&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Pass the Monster Meat, Milady!",
        "sinopsis": "Like any proper noble lady, one must have certain acquired tastes. For Melphiera Marchalrayd, she just happens to crave a rather exotic protein—monsters! But do not judge! Despite its bad reputation, monster meat can be used in exquisite cuisine and Melphiera is determined to change the kingdom's opinion of it! Unfortunately, since debuting in society, Melphiera has been struggling to find her perfect match...until she meets the fearless \"Blood-Mad Duke\" of Galbraith!",
        "genre": [
            "Fantasy",
            "Gourmet",
            "Romance"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/akujiki-reijou-to-kyouketsu-koushaku-sono-mamono-watashi-ga-oishiku-itadakimasu-c668-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68deb21c169c31976b42e5cd&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Star Wars: Visions Volume 3",
        "sinopsis": "Third volume of Star Wars: Visions.",
        "genre": [
            "Action",
            "Adventure",
            "Military",
            "Sci-Fi",
            "Space"
        ],
        "metadata": [
            "ONA",
            "PG-13",
            "Finished",
            "2025",
            "22 min",
            "SUB",
            "DUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/star-wars-visions-volume-3-a750-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=69039dfb169c31976bc88305&source=vidstream&ln=en-US"
    },
    {
        "judul": "Solo Camping for Two",
        "sinopsis": "The story centers on Gen Kinokura, a devoted solo camper who treasures his solitude. During one of his usual camping trips, he unexpectedly crosses paths with Shizuku Kusano, a total camping novice. What starts as an accidental encounter evolves into an unusual partnership, as the two embark on what can only be described as \"solo camping for two.\"",
        "genre": [
            "Adult Cast",
            "Seinen",
            "Slice of Life"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "24 min",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/solo-camping-for-two-782b-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=686ffba4169c31976be6c5a8&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "A Star Brighter Than the Sun",
        "sinopsis": "Sae and Koki have been friends since childhood. One fateful day at the end of middle school, she has a revelation: Koki has grown up! Now they're in high school, and she has another revelation: she has feelings for Koki! But Sae isn't the only girl who does... The question is, who does Koki have feelings for?!",
        "genre": [
            "Romance",
            "School",
            "Shoujo"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "24 min",
            "SUB",
            "DUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/taiyou-yori-mo-mabushii-hoshi-5cfc-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68def5ee169c31976b4a5ae4&source=vidstream&ln=en-US"
    },
    {
        "judul": "This Monster Wants to Eat Me",
        "sinopsis": "\"I've come to eat you,\" so softly utters the mermaid Shiori as she emerges from the sea and takes high school girl Hinako by the hand. Hinako lives alone in a town by the sea and possesses an unusually delicious body that is irresistible to nearby monsters. To ensure that she matures to the best condition, Shiori seeks to protect Hinako—all so that someday, she can devour every piece of her. What will become of Hinako's feelings as this looming unjust death closes in on her...?",
        "genre": [
            "Drama",
            "Girls Love",
            "Seinen",
            "Supernatural"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/watashi-wo-tabetai-hitodenashi-8f6a-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68de9148169c31976b3f4e85&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "My Awkward Senpai",
        "sinopsis": "Kannawa-senpai is considered many things, but smooth is definitely not one of them. Then she meets Kamegawa, her new Kouhai. He's cute, a little nerdy, and easy to talk to. How will this awkward Senpai be able to handle these new feelings?!",
        "genre": [
            "Adult Cast",
            "Comedy",
            "Romance",
            "Seinen",
            "Workplace"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/bukiyou-na-senpai-aabb-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68de8b0d169c31976b3ebf80&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "BanG Dream-chan",
        "sinopsis": "New mini Anime series for BanG Dream!.",
        "genre": [],
        "metadata": [
            "ONA",
            "G",
            "Airing",
            "2025",
            "2 min",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/ganso-bandori-chan-befc-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68fa2ee8169c31976b68225e&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Koala's Diary",
        "sinopsis": "Koala writes about daily life, whether it's good or bad, happy or sad. Koala treats every day as a precious day.",
        "genre": [
            "Anthropomorphic",
            "Slice of Life"
        ],
        "metadata": [
            "ONA",
            "G",
            "Airing",
            "2025",
            "2 min",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/koalas-diary-eef9-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68def511169c31976b4a4146&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Blue Orchestra Season 2",
        "sinopsis": "Second season of Ao no Orchestra.",
        "genre": [
            "Drama",
            "Music",
            "Performing Arts",
            "School"
        ],
        "metadata": [
            "TV",
            "PG-13",
            "Airing",
            "2025",
            "25 min",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/ao-no-orchestra-2nd-season-0fea-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68f932de169c31976b4f64c7&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Dragon Raja II: The Mourner's Eyes",
        "sinopsis": "Second season of Long Zu (Dragon Raja).",
        "genre": [
            "Adventure",
            "Fantasy"
        ],
        "metadata": [
            "ONA",
            "PG-13",
            "Airing",
            "2025",
            "24 min",
            "SUB",
            "DUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/dragon-raja-season-2-ba6d-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e72c26169c31976b3be7a1&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Let's Play",
        "sinopsis": "Samara \"Sam\" Young is a developer in Los Angeles who's about to achieve her dreams with her first video game, Ruminate. That is, until a popular streamer gives the game a scathing review. Even worse, Sam finds out the troublesome critic is now her new neighbor! Get lost in a comedic, romantic, and all-too-real story about gaming, memes, and social anxiety. Come for the plot, stay for the doggo.",
        "genre": [
            "Comedy",
            "Romance"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "23 min",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/lets-play-34ec-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68ddab15169c31976b2ed104&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "The Dark History of the Reincarnated Villainess",
        "sinopsis": "Konoha Satou has a dark history. After all, she spent her teen years writing self-indulgent fantasy romance fics-like her Dark History. But since she's become its most despicable villainess, remembering every last detail is now a matter of life-and-death. Having avoided the first couple of death flags, Satou's suddenly left in the dark when a mysterious stranger returns from the Lily Kingdom-a character she doesn't recall writing in the original script. Although Yomi claims to be her ally, can Satou really trust a character she knows nothing about in such a dangerous world?",
        "genre": [
            "Comedy",
            "Fantasy",
            "Isekai",
            "Reincarnation",
            "Romance",
            "Shoujo"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/the-dark-history-of-the-reincarnated-villainess-6c5e-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e69386169c31976b295906&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Wandance",
        "sinopsis": "Kaboku Kotani is starting high school, and he plans to do what he's always done: go along with his friends, keep quiet, and not draw too much attention to himself. After all, it's hard enough to get by with a stutter like his—why make things worse by standing out from the crowd? But then he sees another first-year, Hikari Wanda, dancing like no one is watching—or like she doesn't care who sees her. It makes Kaboku wonder: Could he reach that same freedom? To find his way to Wanda, he does something he never thought he could: He joins the dance club. After all, every routine begins with a single step, right? Join Kaboku and Wanda as they freestyle their way to life and love!",
        "genre": [
            "Performing Arts",
            "School",
            "Seinen",
            "Sports"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/wondance-9444-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e69427169c31976b29730b&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Kakuriyo: Bed and Breakfast for Spirits Season 2",
        "sinopsis": "Second season of Kakuriyo no Yadomeshi.",
        "genre": [
            "Adult Cast",
            "Drama",
            "Fantasy",
            "Gourmet",
            "Isekai",
            "Mythology",
            "Romance"
        ],
        "metadata": [
            "TV",
            "PG-13",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/kakuriyo-no-yadomeshi-2nd-season-081a-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68ddaa48169c31976b2ebd67&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Hero Without a Class: Who Even Needs Skills?!",
        "sinopsis": "\"Classes\" are given at the age of 10, and the presence or absence of \"skills\" greatly affects life. Arel, the son of \"Sword Princess\" Fara and \"Magic King\" Leon, has been branded as \"Classless\"... But even without a job or skills, Arel believes he can persevere through effort.",
        "genre": [
            "Action",
            "Adventure",
            "Comedy",
            "Fantasy"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/mushoku-no-eiyuu-betsu-ni-skill-nanka-iranakatta-n-da-ga-055e-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68d3f329169c31976b41fe75&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Style of Hiroshi Nohara Lunch",
        "sinopsis": "This series follows Hiroshi Nohara's ultimate lunchtime philosophy, as he carefully selects and enjoys his midday meals within the constraints of a limited budget and break time. But it's not just about savoring food—Hiroshi delves into cooking trivia, preparation methods, and the everyday dilemmas of a salaryman. From debating whether to treat his juniors to lunch, to finding quick meals between sales meetings, and even venting about his boss, the series is packed with relatable moments for working professionals.",
        "genre": [
            "Comedy",
            "Gourmet"
        ],
        "metadata": [
            "TV",
            "PG-13",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/nohara-hiroshi-hiru-meshi-no-ryuugi-ac7e-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e062fe169c31976b6ab7d9&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Back as Immortal Lord",
        "sinopsis": "The young warrior Yun Qingyan disappeared from the world three years ago, but he was actually drawn into the fairy world for three thousand years! With his extraordinary talent, he became the Yun Emperor, one of the ten great fairy emperors. However, because he was tired of the intrigues in the fairy world and missed his family, he decided to return to the human world at all costs. Upon return to the human world, his parents and sister strangely disappeared, and due to an incident whilst traveling from the fairy world to the human world, he lost his magic weapon and his cultivation became almost zero. Major forces took this opportunity to hunt him down. The fairy emperor became the target of public criticism, and his family was in danger! Yun Qingyan relied on his extraordinary fairy emperor talent to refine pills and array formations, study and practice, and overwhelm his enemies. He embarked on an adventure to revive his family, find his relatives, and rectify the mortal world.",
        "genre": [
            "Action",
            "Adventure",
            "Fantasy"
        ],
        "metadata": [
            "ONA",
            "PG-13",
            "Airing",
            "2025",
            "15 min"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/back-as-immortal-lord-2e94-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=MjU4NTRkNmE0MWY1M2IyNzdhOGVmZWNkMDFhYTBlYmU6MTI4NGVlZWQ5Yjk0OWFkYzFkMDAxYjJkMDQ0MGY5YmI&type=hls"
    },
    {
        "judul": "Ninja vs. Gokudo",
        "sinopsis": "Since ancient times, the ninja and the yakuza have been at war, spilling blood around the world as empires rise and fall. So when, in the modern age, Shinoha, a ninja, meets Kiwami, a gangster following the path of the yakuza—the gokudo—and discovers they have common interests, the obvious assumption is that nothing good can come of it. But can it be that one burgeoning bromance will shake up a 300-year grudge? Who will win the struggle for real ultimate power?",
        "genre": [
            "Action",
            "Adult Cast",
            "Martial Arts",
            "Organized Crime"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "23 min",
            "SUB",
            "DUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/ninja-to-gokudou-a245-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e5aff2169c31976b148181&source=vidstream&ln=en-US"
    },
    {
        "judul": "Yano-kun's Ordinary Days",
        "sinopsis": "Always reliable and kind-hearted, Kiyoko Yoshida is named the president of Class 2-1. On the first day of school, a boy named Yano Tsuyoshi arrives late, covered in injuries. Due to her caring nature, in addition to Yano being seated right next to her, Kiyoko cannot help but worry about him and how he got those injuries to begin with. After cautiously following him home one day, she learns the truth—he is just extremely clumsy. Kiyoko soon finds herself constantly worrying about Yano, both at school and at home, not realizing that she is falling in love with him. Armed with a first aid kit, Kiyoko makes it her mission to care for Yano's mishap-related injuries as a romance between the two begins to blossom.",
        "genre": [
            "Comedy",
            "Romance",
            "School"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/yano-kun-no-futsuu-no-hibi-0005-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68dc4993169c31976b10d036&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "Chitose Is in the Ramune Bottle",
        "sinopsis": "Insults aimed at Saku Chitose are a dime a dozen. Nicknamed \"Class 5's womanizing scumbag,\" he is constantly slandered online by those jealous of his popularity. Luckily, that barely makes a dent in Saku's confidence. Outside niche internet forums, he is the reputable figure his schoolmates admire and a model student his teachers trust. As his second year of high school commences, Saku reunites with his old friends and befriends new ones, all belonging to the school's social elite. However, the fun is cut short when Saku's homeroom teacher instructs him to convince his shut-in classmate, Kenta Yamazaki, to return to school. Wishing to wrap things up quickly, Saku visits Kenta's house the very next day. But the task proves more challenging than he expected when he discovers that Kenta is firmly and fully on the Saku hate train. If he wants to preserve his impeccable image, Saku must find a way to win over Kenta and bring him back to school.",
        "genre": [
            "Comedy",
            "Harem",
            "Romance",
            "School"
        ],
        "metadata": [
            "TV",
            "PG-13",
            "Airing",
            "2025",
            "25 min",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/chitose-kun-wa-ramune-bin-no-naka-1a29-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68e5ddf9169c31976b18c905&source=vidstream&ln=ja-JP"
    },
    {
        "judul": "With You, Our Love Will Make It Through",
        "sinopsis": "When high schooler Mari bumps into a fellow tardy student, she's surprised to find out he's a beastfolk who's to attend her school! After all, it's not rare for beastfolk to coexist alongside humans, but it's still uncommon, with the prejudice and all. Nervous to meet one at first, Mari soon learns there's more to him than his furry exterior. In fact, the more she gets to know him, the more she finds herself drawn to him, his steadfastness, his kindheartedness, and... his body...",
        "genre": [
            "Anthropomorphic",
            "Fantasy",
            "Romance",
            "School",
            "Urban Fantasy"
        ],
        "metadata": [
            "TV",
            "Airing",
            "2025",
            "SUB"
        ],
        "url_poster": "https://kickass-anime.ru/image/poster/kimi-to-koete-koi-ni-naru-83d1-hq.webp",
        "url_iframe": "https://krussdomi.com/cat-player/player?id=68ee9175169c31976b1d0352&source=vidstream&ln=ja-JP"
    }
]